Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMC20_DFP/3.5.93/samc20/edc/ATSAMC20E18A.PIC
      <edc:AdjustPoint edc:offset="0xB" edc:_addr="0x40000805"/>
      <edc:SFRDef ltx:memberofperipheral="MCLK" edc:cname="AHBMASK" edc:nzwidth="0x20" edc:access="-------------------nnn--nnnnnnnn" edc:por="00000000000000000001110011111111" edc:mclr="00000000000000000001110011111111" edc:impl="0x1CFF" edc:_addr="0x40000810">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MCLK">
            <edc:SFRFieldDef edc:cname="HPB0_" edc:nzwidth="0x1" edc:desc="HPB0 AHB Clock Mask"/>
            <edc:SFRFieldDef edc:cname="HPB1_" edc:nzwidth="0x1" edc:desc="HPB1 AHB Clock Mask"/>
            <edc:SFRFieldDef edc:cname="HPB2_" edc:nzwidth="0x1" edc:desc="HPB2 AHB Clock Mask"/>
            <edc:SFRFieldDef edc:cname="DSU_" edc:nzwidth="0x1" edc:desc="DSU AHB Clock Mask"/>
            <edc:SFRFieldDef edc:cname="HMATRIXHS_" edc:nzwidth="0x1" edc:desc="HMATRIXHS AHB Clock Mask"/>
            <edc:SFRFieldDef edc:cname="NVMCTRL_" edc:nzwidth="0x1" edc:desc="NVMCTRL AHB Clock Mask"/>
            <edc:SFRFieldDef edc:cname="HSRAM_" edc:nzwidth="0x1" edc:desc="HSRAM AHB Clock Mask"/>
            <edc:SFRFieldDef edc:cname="DMAC_" edc:nzwidth="0x1" edc:desc="DMAC AHB Clock Mask"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="PAC_" edc:nzwidth="0x1" edc:desc="PAC AHB Clock Mask"/>
            <edc:SFRFieldDef edc:cname="NVMCTRL_PICACHU_" edc:nzwidth="0x1" edc:desc="NVMCTRL_PICACHU AHB Clock Mask"/>
            <edc:SFRFieldDef edc:cname="DIVAS_" edc:nzwidth="0x1" edc:desc="DIVAS AHB Clock Mask"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MCLK" edc:cname="APBAMASK" edc:nzwidth="0x20" edc:access="--------------------nnnnnnnnnnnn" edc:por="00000000000000000000111111111111" edc:mclr="00000000000000000000111111111111" edc:impl="0xFFF" edc:_addr="0x40000814">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MCLK">
            <edc:SFRFieldDef edc:cname="PAC_" edc:nzwidth="0x1" edc:desc="PAC APB Clock Enable"/>
            <edc:SFRFieldDef edc:cname="PM_" edc:nzwidth="0x1" edc:desc="PM APB Clock Enable"/>
            <edc:SFRFieldDef edc:cname="MCLK_" edc:nzwidth="0x1" edc:desc="MCLK APB Clock Enable"/>
            <edc:SFRFieldDef edc:cname="RSTC_" edc:nzwidth="0x1" edc:desc="RSTC APB Clock Enable"/>
            <edc:SFRFieldDef edc:cname="OSCCTRL_" edc:nzwidth="0x1" edc:desc="OSCCTRL APB Clock Enable"/>
            <edc:SFRFieldDef edc:cname="OSC32KCTRL_" edc:nzwidth="0x1" edc:desc="OSC32KCTRL APB Clock Enable"/>
            <edc:SFRFieldDef edc:cname="SUPC_" edc:nzwidth="0x1" edc:desc="SUPC APB Clock Enable"/>
            <edc:SFRFieldDef edc:cname="GCLK_" edc:nzwidth="0x1" edc:desc="GCLK APB Clock Enable"/>
            <edc:SFRFieldDef edc:cname="WDT_" edc:nzwidth="0x1" edc:desc="WDT APB Clock Enable"/>
            <edc:SFRFieldDef edc:cname="RTC_" edc:nzwidth="0x1" edc:desc="RTC APB Clock Enable"/>
            <edc:SFRFieldDef edc:cname="EIC_" edc:nzwidth="0x1" edc:desc="EIC APB Clock Enable"/>
            <edc:SFRFieldDef edc:cname="FREQM_" edc:nzwidth="0x1" edc:desc="FREQM APB Clock Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MCLK" edc:cname="APBBMASK" edc:nzwidth="0x20" edc:access="--------------------------n--nnn" edc:por="00000000000000000000000000000111" edc:mclr="00000000000000000000000000000111" edc:impl="0x27" edc:_addr="0x40000818">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MCLK">
            <edc:SFRFieldDef edc:cname="PORT_" edc:nzwidth="0x1" edc:desc="PORT APB Clock Enable"/>
            <edc:SFRFieldDef edc:cname="DSU_" edc:nzwidth="0x1" edc:desc="DSU APB Clock Enable"/>
            <edc:SFRFieldDef edc:cname="NVMCTRL_" edc:nzwidth="0x1" edc:desc="NVMCTRL APB Clock Enable"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="HMATRIXHS_" edc:nzwidth="0x1" edc:desc="HMATRIXHS APB Clock Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MCLK" edc:cname="APBCMASK" edc:nzwidth="0x20" edc:access="--------nn-n--nnnnnnnnn----nnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xD3FE1F" edc:_addr="0x4000081C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MCLK">
            <edc:SFRFieldDef edc:cname="EVSYS_" edc:nzwidth="0x1" edc:desc="EVSYS APB Clock Enable"/>
            <edc:SFRFieldDef edc:cname="SERCOM0_" edc:nzwidth="0x1" edc:desc="SERCOM0 APB Clock Enable"/>
            <edc:SFRFieldDef edc:cname="SERCOM1_" edc:nzwidth="0x1" edc:desc="SERCOM1 APB Clock Enable"/>
            <edc:SFRFieldDef edc:cname="SERCOM2_" edc:nzwidth="0x1" edc:desc="SERCOM2 APB Clock Enable"/>
            <edc:SFRFieldDef edc:cname="SERCOM3_" edc:nzwidth="0x1" edc:desc="SERCOM3 APB Clock Enable"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="TCC0_" edc:nzwidth="0x1" edc:desc="TCC0 APB Clock Enable"/>
            <edc:SFRFieldDef edc:cname="TCC1_" edc:nzwidth="0x1" edc:desc="TCC1 APB Clock Enable"/>
            <edc:SFRFieldDef edc:cname="TCC2_" edc:nzwidth="0x1" edc:desc="TCC2 APB Clock Enable"/>
            <edc:SFRFieldDef edc:cname="TC0_" edc:nzwidth="0x1" edc:desc="TC0 APB Clock Enable"/>
            <edc:SFRFieldDef edc:cname="TC1_" edc:nzwidth="0x1" edc:desc="TC1 APB Clock Enable"/>
            <edc:SFRFieldDef edc:cname="TC2_" edc:nzwidth="0x1" edc:desc="TC2 APB Clock Enable"/>
            <edc:SFRFieldDef edc:cname="TC3_" edc:nzwidth="0x1" edc:desc="TC3 APB Clock Enable"/>
            <edc:SFRFieldDef edc:cname="TC4_" edc:nzwidth="0x1" edc:desc="TC4 APB Clock Enable"/>
            <edc:SFRFieldDef edc:cname="ADC0_" edc:nzwidth="0x1" edc:desc="ADC0 APB Clock Enable"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="AC_" edc:nzwidth="0x1" edc:desc="AC APB Clock Enable"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PTC_" edc:nzwidth="0x1" edc:desc="PTC APB Clock Enable"/>
            <edc:SFRFieldDef edc:cname="CCL_" edc:nzwidth="0x1" edc:desc="CCL APB Clock Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x3E0" edc:_addr="0x40000820"/>
      <edc:SFRDef ltx:memberofperipheral="RSTC" edc:cname="RCAUSE" edc:nzwidth="0x8" edc:access="-rrr-rrr" edc:impl="0x77" edc:_addr="0x40000C00">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RSTC">
            <edc:SFRFieldDef edc:cname="POR" edc:nzwidth="0x1" edc:desc="Power On Reset"/>
            <edc:SFRFieldDef edc:cname="BODCORE" edc:nzwidth="0x1" edc:desc="Brown Out CORE Detector Reset"/>
            <edc:SFRFieldDef edc:cname="BODVDD" edc:nzwidth="0x1" edc:desc="Brown Out VDD Detector Reset"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="EXT" edc:nzwidth="0x1" edc:desc="External Reset"/>
            <edc:SFRFieldDef edc:cname="WDT" edc:nzwidth="0x1" edc:desc="Watchdog Reset"/>
            <edc:SFRFieldDef edc:cname="SYST" edc:nzwidth="0x1" edc:desc="System Reset Request"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
