Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMC20_DFP/3.5.93/samc20/edc/ATSAMC20E18A.PIC
      <edc:AdjustPoint edc:offset="0x18" edc:_addr="0x40001C08"/>
      <edc:SFRDef ltx:memberofperipheral="GCLK" edc:cname="GENCTRL0" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnn--nnnnnn-----nnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFFFF3F07" edc:_addr="0x40001C20">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GCLK">
            <edc:SFRFieldDef edc:cname="SRC" edc:nzwidth="0x3" edc:desc="Source Select">
              <edc:SFRFieldSemantic edc:cname="XOSC" edc:desc="XOSC oscillator output" edc:when="(field &amp; 0x7) == 0"/>
              <edc:SFRFieldSemantic edc:cname="GCLKIN" edc:desc="Generator input pad" edc:when="(field &amp; 0x7) == 1"/>
              <edc:SFRFieldSemantic edc:cname="GCLKGEN1" edc:desc="Generic clock generator 1 output" edc:when="(field &amp; 0x7) == 2"/>
              <edc:SFRFieldSemantic edc:cname="OSCULP32K" edc:desc="OSCULP32K oscillator output" edc:when="(field &amp; 0x7) == 3"/>
              <edc:SFRFieldSemantic edc:cname="OSC32K" edc:desc="OSC32K oscillator output" edc:when="(field &amp; 0x7) == 4"/>
              <edc:SFRFieldSemantic edc:cname="XOSC32K" edc:desc="XOSC32K oscillator output" edc:when="(field &amp; 0x7) == 5"/>
              <edc:SFRFieldSemantic edc:cname="OSC48M" edc:desc="OSC48M oscillator output" edc:when="(field &amp; 0x7) == 6"/>
              <edc:SFRFieldSemantic edc:cname="DPLL96M" edc:desc="DPLL96M output" edc:when="(field &amp; 0x7) == 7"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="GENEN" edc:nzwidth="0x1" edc:desc="Generic Clock Generator Enable"/>
            <edc:SFRFieldDef edc:cname="IDC" edc:nzwidth="0x1" edc:desc="Improve Duty Cycle"/>
            <edc:SFRFieldDef edc:cname="OOV" edc:nzwidth="0x1" edc:desc="Output Off Value"/>
            <edc:SFRFieldDef edc:cname="OE" edc:nzwidth="0x1" edc:desc="Output Enable"/>
            <edc:SFRFieldDef edc:cname="DIVSEL" edc:nzwidth="0x1" edc:desc="Divide Selection">
              <edc:SFRFieldSemantic edc:cname="DIV1" edc:desc="Divide input directly by divider factor" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="DIV2" edc:desc="Divide input by 2^(divider factor+ 1)" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="RUNSTDBY" edc:nzwidth="0x1" edc:desc="Run in Standby"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="DIV" edc:nzwidth="0x10" edc:desc="Division Factor"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="GCLK" edc:cname="GENCTRL1" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnn--nnnnnn-----nnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFFFF3F07" edc:_addr="0x40001C24">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GCLK">
            <edc:SFRFieldDef edc:cname="SRC" edc:nzwidth="0x3" edc:desc="Source Select">
              <edc:SFRFieldSemantic edc:cname="XOSC" edc:desc="XOSC oscillator output" edc:when="(field &amp; 0x7) == 0"/>
              <edc:SFRFieldSemantic edc:cname="GCLKIN" edc:desc="Generator input pad" edc:when="(field &amp; 0x7) == 1"/>
              <edc:SFRFieldSemantic edc:cname="GCLKGEN1" edc:desc="Generic clock generator 1 output" edc:when="(field &amp; 0x7) == 2"/>
              <edc:SFRFieldSemantic edc:cname="OSCULP32K" edc:desc="OSCULP32K oscillator output" edc:when="(field &amp; 0x7) == 3"/>
              <edc:SFRFieldSemantic edc:cname="OSC32K" edc:desc="OSC32K oscillator output" edc:when="(field &amp; 0x7) == 4"/>
              <edc:SFRFieldSemantic edc:cname="XOSC32K" edc:desc="XOSC32K oscillator output" edc:when="(field &amp; 0x7) == 5"/>
              <edc:SFRFieldSemantic edc:cname="OSC48M" edc:desc="OSC48M oscillator output" edc:when="(field &amp; 0x7) == 6"/>
              <edc:SFRFieldSemantic edc:cname="DPLL96M" edc:desc="DPLL96M output" edc:when="(field &amp; 0x7) == 7"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="GENEN" edc:nzwidth="0x1" edc:desc="Generic Clock Generator Enable"/>
            <edc:SFRFieldDef edc:cname="IDC" edc:nzwidth="0x1" edc:desc="Improve Duty Cycle"/>
            <edc:SFRFieldDef edc:cname="OOV" edc:nzwidth="0x1" edc:desc="Output Off Value"/>
            <edc:SFRFieldDef edc:cname="OE" edc:nzwidth="0x1" edc:desc="Output Enable"/>
            <edc:SFRFieldDef edc:cname="DIVSEL" edc:nzwidth="0x1" edc:desc="Divide Selection">
              <edc:SFRFieldSemantic edc:cname="DIV1" edc:desc="Divide input directly by divider factor" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="DIV2" edc:desc="Divide input by 2^(divider factor+ 1)" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="RUNSTDBY" edc:nzwidth="0x1" edc:desc="Run in Standby"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="DIV" edc:nzwidth="0x10" edc:desc="Division Factor"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="GCLK" edc:cname="GENCTRL2" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnn--nnnnnn-----nnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFFFF3F07" edc:_addr="0x40001C28">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GCLK">
            <edc:SFRFieldDef edc:cname="SRC" edc:nzwidth="0x3" edc:desc="Source Select">
              <edc:SFRFieldSemantic edc:cname="XOSC" edc:desc="XOSC oscillator output" edc:when="(field &amp; 0x7) == 0"/>
              <edc:SFRFieldSemantic edc:cname="GCLKIN" edc:desc="Generator input pad" edc:when="(field &amp; 0x7) == 1"/>
              <edc:SFRFieldSemantic edc:cname="GCLKGEN1" edc:desc="Generic clock generator 1 output" edc:when="(field &amp; 0x7) == 2"/>
              <edc:SFRFieldSemantic edc:cname="OSCULP32K" edc:desc="OSCULP32K oscillator output" edc:when="(field &amp; 0x7) == 3"/>
              <edc:SFRFieldSemantic edc:cname="OSC32K" edc:desc="OSC32K oscillator output" edc:when="(field &amp; 0x7) == 4"/>
              <edc:SFRFieldSemantic edc:cname="XOSC32K" edc:desc="XOSC32K oscillator output" edc:when="(field &amp; 0x7) == 5"/>
              <edc:SFRFieldSemantic edc:cname="OSC48M" edc:desc="OSC48M oscillator output" edc:when="(field &amp; 0x7) == 6"/>
              <edc:SFRFieldSemantic edc:cname="DPLL96M" edc:desc="DPLL96M output" edc:when="(field &amp; 0x7) == 7"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="GENEN" edc:nzwidth="0x1" edc:desc="Generic Clock Generator Enable"/>
            <edc:SFRFieldDef edc:cname="IDC" edc:nzwidth="0x1" edc:desc="Improve Duty Cycle"/>
            <edc:SFRFieldDef edc:cname="OOV" edc:nzwidth="0x1" edc:desc="Output Off Value"/>
            <edc:SFRFieldDef edc:cname="OE" edc:nzwidth="0x1" edc:desc="Output Enable"/>
            <edc:SFRFieldDef edc:cname="DIVSEL" edc:nzwidth="0x1" edc:desc="Divide Selection">
              <edc:SFRFieldSemantic edc:cname="DIV1" edc:desc="Divide input directly by divider factor" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="DIV2" edc:desc="Divide input by 2^(divider factor+ 1)" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="RUNSTDBY" edc:nzwidth="0x1" edc:desc="Run in Standby"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="DIV" edc:nzwidth="0x10" edc:desc="Division Factor"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="GCLK" edc:cname="GENCTRL3" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnn--nnnnnn-----nnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFFFF3F07" edc:_addr="0x40001C2C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GCLK">
            <edc:SFRFieldDef edc:cname="SRC" edc:nzwidth="0x3" edc:desc="Source Select">
              <edc:SFRFieldSemantic edc:cname="XOSC" edc:desc="XOSC oscillator output" edc:when="(field &amp; 0x7) == 0"/>
              <edc:SFRFieldSemantic edc:cname="GCLKIN" edc:desc="Generator input pad" edc:when="(field &amp; 0x7) == 1"/>
              <edc:SFRFieldSemantic edc:cname="GCLKGEN1" edc:desc="Generic clock generator 1 output" edc:when="(field &amp; 0x7) == 2"/>
              <edc:SFRFieldSemantic edc:cname="OSCULP32K" edc:desc="OSCULP32K oscillator output" edc:when="(field &amp; 0x7) == 3"/>
              <edc:SFRFieldSemantic edc:cname="OSC32K" edc:desc="OSC32K oscillator output" edc:when="(field &amp; 0x7) == 4"/>
              <edc:SFRFieldSemantic edc:cname="XOSC32K" edc:desc="XOSC32K oscillator output" edc:when="(field &amp; 0x7) == 5"/>
              <edc:SFRFieldSemantic edc:cname="OSC48M" edc:desc="OSC48M oscillator output" edc:when="(field &amp; 0x7) == 6"/>
              <edc:SFRFieldSemantic edc:cname="DPLL96M" edc:desc="DPLL96M output" edc:when="(field &amp; 0x7) == 7"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="GENEN" edc:nzwidth="0x1" edc:desc="Generic Clock Generator Enable"/>
            <edc:SFRFieldDef edc:cname="IDC" edc:nzwidth="0x1" edc:desc="Improve Duty Cycle"/>
            <edc:SFRFieldDef edc:cname="OOV" edc:nzwidth="0x1" edc:desc="Output Off Value"/>
            <edc:SFRFieldDef edc:cname="OE" edc:nzwidth="0x1" edc:desc="Output Enable"/>
            <edc:SFRFieldDef edc:cname="DIVSEL" edc:nzwidth="0x1" edc:desc="Divide Selection">
              <edc:SFRFieldSemantic edc:cname="DIV1" edc:desc="Divide input directly by divider factor" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="DIV2" edc:desc="Divide input by 2^(divider factor+ 1)" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="RUNSTDBY" edc:nzwidth="0x1" edc:desc="Run in Standby"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="DIV" edc:nzwidth="0x10" edc:desc="Division Factor"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="GCLK" edc:cname="GENCTRL4" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnn--nnnnnn-----nnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFFFF3F07" edc:_addr="0x40001C30">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GCLK">
            <edc:SFRFieldDef edc:cname="SRC" edc:nzwidth="0x3" edc:desc="Source Select">
              <edc:SFRFieldSemantic edc:cname="XOSC" edc:desc="XOSC oscillator output" edc:when="(field &amp; 0x7) == 0"/>
              <edc:SFRFieldSemantic edc:cname="GCLKIN" edc:desc="Generator input pad" edc:when="(field &amp; 0x7) == 1"/>
              <edc:SFRFieldSemantic edc:cname="GCLKGEN1" edc:desc="Generic clock generator 1 output" edc:when="(field &amp; 0x7) == 2"/>
              <edc:SFRFieldSemantic edc:cname="OSCULP32K" edc:desc="OSCULP32K oscillator output" edc:when="(field &amp; 0x7) == 3"/>
              <edc:SFRFieldSemantic edc:cname="OSC32K" edc:desc="OSC32K oscillator output" edc:when="(field &amp; 0x7) == 4"/>
              <edc:SFRFieldSemantic edc:cname="XOSC32K" edc:desc="XOSC32K oscillator output" edc:when="(field &amp; 0x7) == 5"/>
              <edc:SFRFieldSemantic edc:cname="OSC48M" edc:desc="OSC48M oscillator output" edc:when="(field &amp; 0x7) == 6"/>
              <edc:SFRFieldSemantic edc:cname="DPLL96M" edc:desc="DPLL96M output" edc:when="(field &amp; 0x7) == 7"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="GENEN" edc:nzwidth="0x1" edc:desc="Generic Clock Generator Enable"/>
            <edc:SFRFieldDef edc:cname="IDC" edc:nzwidth="0x1" edc:desc="Improve Duty Cycle"/>
            <edc:SFRFieldDef edc:cname="OOV" edc:nzwidth="0x1" edc:desc="Output Off Value"/>
            <edc:SFRFieldDef edc:cname="OE" edc:nzwidth="0x1" edc:desc="Output Enable"/>
            <edc:SFRFieldDef edc:cname="DIVSEL" edc:nzwidth="0x1" edc:desc="Divide Selection">
              <edc:SFRFieldSemantic edc:cname="DIV1" edc:desc="Divide input directly by divider factor" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="DIV2" edc:desc="Divide input by 2^(divider factor+ 1)" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="RUNSTDBY" edc:nzwidth="0x1" edc:desc="Run in Standby"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="DIV" edc:nzwidth="0x10" edc:desc="Division Factor"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
