Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMC20_DFP/3.5.93/samc20/edc/ATSAMC20E18A.PIC
      <edc:SFRDef ltx:memberofperipheral="HMATRIXHS" edc:cname="PRS3PRAS" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x4100A098">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HMATRIXHS">
            <edc:SFRFieldDef edc:cname="M0PR" edc:nzwidth="0x4" edc:desc="Master 0 Priority"/>
            <edc:SFRFieldDef edc:cname="M1PR" edc:nzwidth="0x4" edc:desc="Master 1 Priority"/>
            <edc:SFRFieldDef edc:cname="M2PR" edc:nzwidth="0x4" edc:desc="Master 2 Priority"/>
            <edc:SFRFieldDef edc:cname="M3PR" edc:nzwidth="0x4" edc:desc="Master 3 Priority"/>
            <edc:SFRFieldDef edc:cname="M4PR" edc:nzwidth="0x4" edc:desc="Master 4 Priority"/>
            <edc:SFRFieldDef edc:cname="M5PR" edc:nzwidth="0x4" edc:desc="Master 5 Priority"/>
            <edc:SFRFieldDef edc:cname="M6PR" edc:nzwidth="0x4" edc:desc="Master 6 Priority"/>
            <edc:SFRFieldDef edc:cname="M7PR" edc:nzwidth="0x4" edc:desc="Master 7 Priority"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="HMATRIXHS" edc:cname="PRS3PRBS" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x4100A09C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HMATRIXHS">
            <edc:SFRFieldDef edc:cname="M8PR" edc:nzwidth="0x4" edc:desc="Master 8 Priority"/>
            <edc:SFRFieldDef edc:cname="M9PR" edc:nzwidth="0x4" edc:desc="Master 9 Priority"/>
            <edc:SFRFieldDef edc:cname="M10PR" edc:nzwidth="0x4" edc:desc="Master 10 Priority"/>
            <edc:SFRFieldDef edc:cname="M11PR" edc:nzwidth="0x4" edc:desc="Master 11 Priority"/>
            <edc:SFRFieldDef edc:cname="M12PR" edc:nzwidth="0x4" edc:desc="Master 12 Priority"/>
            <edc:SFRFieldDef edc:cname="M13PR" edc:nzwidth="0x4" edc:desc="Master 13 Priority"/>
            <edc:SFRFieldDef edc:cname="M14PR" edc:nzwidth="0x4" edc:desc="Master 14 Priority"/>
            <edc:SFRFieldDef edc:cname="M15PR" edc:nzwidth="0x4" edc:desc="Master 15 Priority"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x60" edc:_addr="0x4100A0A0"/>
      <edc:SFRDef ltx:memberofperipheral="HMATRIXHS" edc:cname="MRCR" edc:nzwidth="0x20" edc:access="----------------nnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFFFF" edc:_addr="0x4100A100">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HMATRIXHS">
            <edc:SFRFieldDef edc:cname="RCB0" edc:nzwidth="0x1" edc:desc="Remap Command Bit for Master 0">
              <edc:SFRFieldSemantic edc:cname="DIS" edc:desc="Disable remapped address decoding for master" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENA" edc:desc="Enable remapped address decoding for master" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="RCB1" edc:nzwidth="0x1" edc:desc="Remap Command Bit for Master 1">
              <edc:SFRFieldSemantic edc:cname="DIS" edc:desc="Disable remapped address decoding for master" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENA" edc:desc="Enable remapped address decoding for master" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="RCB2" edc:nzwidth="0x1" edc:desc="Remap Command Bit for Master 2">
              <edc:SFRFieldSemantic edc:cname="DIS" edc:desc="Disable remapped address decoding for master" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENA" edc:desc="Enable remapped address decoding for master" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="RCB3" edc:nzwidth="0x1" edc:desc="Remap Command Bit for Master 3">
              <edc:SFRFieldSemantic edc:cname="DIS" edc:desc="Disable remapped address decoding for master" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENA" edc:desc="Enable remapped address decoding for master" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="RCB4" edc:nzwidth="0x1" edc:desc="Remap Command Bit for Master 4">
              <edc:SFRFieldSemantic edc:cname="DIS" edc:desc="Disable remapped address decoding for master" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENA" edc:desc="Enable remapped address decoding for master" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="RCB5" edc:nzwidth="0x1" edc:desc="Remap Command Bit for Master 5">
              <edc:SFRFieldSemantic edc:cname="DIS" edc:desc="Disable remapped address decoding for master" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENA" edc:desc="Enable remapped address decoding for master" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="RCB6" edc:nzwidth="0x1" edc:desc="Remap Command Bit for Master 6">
              <edc:SFRFieldSemantic edc:cname="DIS" edc:desc="Disable remapped address decoding for master" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENA" edc:desc="Enable remapped address decoding for master" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="RCB7" edc:nzwidth="0x1" edc:desc="Remap Command Bit for Master 7">
              <edc:SFRFieldSemantic edc:cname="DIS" edc:desc="Disable remapped address decoding for master" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENA" edc:desc="Enable remapped address decoding for master" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="RCB8" edc:nzwidth="0x1" edc:desc="Remap Command Bit for Master 8">
              <edc:SFRFieldSemantic edc:cname="DIS" edc:desc="Disable remapped address decoding for master" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENA" edc:desc="Enable remapped address decoding for master" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="RCB9" edc:nzwidth="0x1" edc:desc="Remap Command Bit for Master 9">
              <edc:SFRFieldSemantic edc:cname="DIS" edc:desc="Disable remapped address decoding for master" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENA" edc:desc="Enable remapped address decoding for master" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="RCB10" edc:nzwidth="0x1" edc:desc="Remap Command Bit for Master 10">
              <edc:SFRFieldSemantic edc:cname="DIS" edc:desc="Disable remapped address decoding for master" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENA" edc:desc="Enable remapped address decoding for master" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="RCB11" edc:nzwidth="0x1" edc:desc="Remap Command Bit for Master 11">
              <edc:SFRFieldSemantic edc:cname="DIS" edc:desc="Disable remapped address decoding for master" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENA" edc:desc="Enable remapped address decoding for master" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="RCB12" edc:nzwidth="0x1" edc:desc="Remap Command Bit for Master 12">
              <edc:SFRFieldSemantic edc:cname="DIS" edc:desc="Disable remapped address decoding for master" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENA" edc:desc="Enable remapped address decoding for master" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="RCB13" edc:nzwidth="0x1" edc:desc="Remap Command Bit for Master 13">
              <edc:SFRFieldSemantic edc:cname="DIS" edc:desc="Disable remapped address decoding for master" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENA" edc:desc="Enable remapped address decoding for master" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="RCB14" edc:nzwidth="0x1" edc:desc="Remap Command Bit for Master 14">
              <edc:SFRFieldSemantic edc:cname="DIS" edc:desc="Disable remapped address decoding for master" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENA" edc:desc="Enable remapped address decoding for master" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="RCB15" edc:nzwidth="0x1" edc:desc="Remap Command Bit for Master 15">
              <edc:SFRFieldSemantic edc:cname="DIS" edc:desc="Disable remapped address decoding for master" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENA" edc:desc="Enable remapped address decoding for master" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0xC" edc:_addr="0x4100A104"/>
      <edc:SFRDef ltx:memberofperipheral="HMATRIXHS" edc:cname="SFR0" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x4100A110">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HMATRIXHS">
            <edc:SFRFieldDef edc:cname="SFR" edc:nzwidth="0x20" edc:desc="Special Function Register"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="HMATRIXHS" edc:cname="SFR1" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x4100A114">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HMATRIXHS">
            <edc:SFRFieldDef edc:cname="SFR" edc:nzwidth="0x20" edc:desc="Special Function Register"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="HMATRIXHS" edc:cname="SFR2" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x4100A118">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HMATRIXHS">
            <edc:SFRFieldDef edc:cname="SFR" edc:nzwidth="0x20" edc:desc="Special Function Register"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="HMATRIXHS" edc:cname="SFR3" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x4100A11C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HMATRIXHS">
            <edc:SFRFieldDef edc:cname="SFR" edc:nzwidth="0x20" edc:desc="Special Function Register"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
