Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMC20_DFP/3.5.93/samc20/edc/ATSAMC20E18A.PIC
      <edc:AdjustPoint edc:offset="0xFF5EB0" edc:_addr="0x4100A150"/>
      <edc:SFRDef ltx:memberofperipheral="EVSYS" edc:cname="CTRLA" edc:nzwidth="0x8" edc:access="-------n" edc:por="00000000" edc:mclr="00000000" edc:impl="0x1" edc:_addr="0x42000000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EVSYS">
            <edc:SFRFieldDef edc:cname="SWRST" edc:nzwidth="0x1" edc:desc="Software Reset"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0xB" edc:_addr="0x42000001"/>
      <edc:SFRDef ltx:memberofperipheral="EVSYS" edc:cname="CHSTATUS" edc:nzwidth="0x20" edc:access="----------rrrrrr----------rrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x3F003F" edc:_addr="0x4200000C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EVSYS">
            <edc:SFRFieldDef edc:cname="USRRDY0" edc:nzwidth="0x1" edc:desc="Channel 0 User Ready"/>
            <edc:SFRFieldDef edc:cname="USRRDY1" edc:nzwidth="0x1" edc:desc="Channel 1 User Ready"/>
            <edc:SFRFieldDef edc:cname="USRRDY2" edc:nzwidth="0x1" edc:desc="Channel 2 User Ready"/>
            <edc:SFRFieldDef edc:cname="USRRDY3" edc:nzwidth="0x1" edc:desc="Channel 3 User Ready"/>
            <edc:SFRFieldDef edc:cname="USRRDY4" edc:nzwidth="0x1" edc:desc="Channel 4 User Ready"/>
            <edc:SFRFieldDef edc:cname="USRRDY5" edc:nzwidth="0x1" edc:desc="Channel 5 User Ready"/>
            <edc:AdjustPoint edc:offset="0xA"/>
            <edc:SFRFieldDef edc:cname="CHBUSY0" edc:nzwidth="0x1" edc:desc="Channel 0 Busy"/>
            <edc:SFRFieldDef edc:cname="CHBUSY1" edc:nzwidth="0x1" edc:desc="Channel 1 Busy"/>
            <edc:SFRFieldDef edc:cname="CHBUSY2" edc:nzwidth="0x1" edc:desc="Channel 2 Busy"/>
            <edc:SFRFieldDef edc:cname="CHBUSY3" edc:nzwidth="0x1" edc:desc="Channel 3 Busy"/>
            <edc:SFRFieldDef edc:cname="CHBUSY4" edc:nzwidth="0x1" edc:desc="Channel 4 Busy"/>
            <edc:SFRFieldDef edc:cname="CHBUSY5" edc:nzwidth="0x1" edc:desc="Channel 5 Busy"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="EVSYS" edc:cname="INTENCLR" edc:nzwidth="0x20" edc:access="----------nnnnnn----------nnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x3F003F" edc:_addr="0x42000010">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EVSYS">
            <edc:SFRFieldDef edc:cname="OVR0" edc:nzwidth="0x1" edc:desc="Channel 0 Overrun Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="OVR1" edc:nzwidth="0x1" edc:desc="Channel 1 Overrun Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="OVR2" edc:nzwidth="0x1" edc:desc="Channel 2 Overrun Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="OVR3" edc:nzwidth="0x1" edc:desc="Channel 3 Overrun Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="OVR4" edc:nzwidth="0x1" edc:desc="Channel 4 Overrun Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="OVR5" edc:nzwidth="0x1" edc:desc="Channel 5 Overrun Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0xA"/>
            <edc:SFRFieldDef edc:cname="EVD0" edc:nzwidth="0x1" edc:desc="Channel 0 Event Detection Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="EVD1" edc:nzwidth="0x1" edc:desc="Channel 1 Event Detection Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="EVD2" edc:nzwidth="0x1" edc:desc="Channel 2 Event Detection Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="EVD3" edc:nzwidth="0x1" edc:desc="Channel 3 Event Detection Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="EVD4" edc:nzwidth="0x1" edc:desc="Channel 4 Event Detection Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="EVD5" edc:nzwidth="0x1" edc:desc="Channel 5 Event Detection Interrupt Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="EVSYS" edc:cname="INTENSET" edc:nzwidth="0x20" edc:access="----------nnnnnn----------nnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x3F003F" edc:_addr="0x42000014">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EVSYS">
            <edc:SFRFieldDef edc:cname="OVR0" edc:nzwidth="0x1" edc:desc="Channel 0 Overrun Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="OVR1" edc:nzwidth="0x1" edc:desc="Channel 1 Overrun Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="OVR2" edc:nzwidth="0x1" edc:desc="Channel 2 Overrun Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="OVR3" edc:nzwidth="0x1" edc:desc="Channel 3 Overrun Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="OVR4" edc:nzwidth="0x1" edc:desc="Channel 4 Overrun Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="OVR5" edc:nzwidth="0x1" edc:desc="Channel 5 Overrun Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0xA"/>
            <edc:SFRFieldDef edc:cname="EVD0" edc:nzwidth="0x1" edc:desc="Channel 0 Event Detection Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="EVD1" edc:nzwidth="0x1" edc:desc="Channel 1 Event Detection Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="EVD2" edc:nzwidth="0x1" edc:desc="Channel 2 Event Detection Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="EVD3" edc:nzwidth="0x1" edc:desc="Channel 3 Event Detection Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="EVD4" edc:nzwidth="0x1" edc:desc="Channel 4 Event Detection Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="EVD5" edc:nzwidth="0x1" edc:desc="Channel 5 Event Detection Interrupt Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="EVSYS" edc:cname="INTFLAG" edc:nzwidth="0x20" edc:access="----------nnnnnn----------nnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x3F003F" edc:_addr="0x42000018">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EVSYS">
            <edc:SFRFieldDef edc:cname="OVR0" edc:nzwidth="0x1" edc:desc="Channel 0 Overrun"/>
            <edc:SFRFieldDef edc:cname="OVR1" edc:nzwidth="0x1" edc:desc="Channel 1 Overrun"/>
            <edc:SFRFieldDef edc:cname="OVR2" edc:nzwidth="0x1" edc:desc="Channel 2 Overrun"/>
            <edc:SFRFieldDef edc:cname="OVR3" edc:nzwidth="0x1" edc:desc="Channel 3 Overrun"/>
            <edc:SFRFieldDef edc:cname="OVR4" edc:nzwidth="0x1" edc:desc="Channel 4 Overrun"/>
            <edc:SFRFieldDef edc:cname="OVR5" edc:nzwidth="0x1" edc:desc="Channel 5 Overrun"/>
            <edc:AdjustPoint edc:offset="0xA"/>
            <edc:SFRFieldDef edc:cname="EVD0" edc:nzwidth="0x1" edc:desc="Channel 0 Event Detection"/>
            <edc:SFRFieldDef edc:cname="EVD1" edc:nzwidth="0x1" edc:desc="Channel 1 Event Detection"/>
            <edc:SFRFieldDef edc:cname="EVD2" edc:nzwidth="0x1" edc:desc="Channel 2 Event Detection"/>
            <edc:SFRFieldDef edc:cname="EVD3" edc:nzwidth="0x1" edc:desc="Channel 3 Event Detection"/>
            <edc:SFRFieldDef edc:cname="EVD4" edc:nzwidth="0x1" edc:desc="Channel 4 Event Detection"/>
            <edc:SFRFieldDef edc:cname="EVD5" edc:nzwidth="0x1" edc:desc="Channel 5 Event Detection"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="EVSYS" edc:cname="SWEVT" edc:nzwidth="0x20" edc:access="--------------------------wwwwww" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x3F" edc:_addr="0x4200001C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EVSYS">
            <edc:SFRFieldDef edc:cname="CHANNEL0" edc:nzwidth="0x1" edc:desc="Channel 0 Software Selection"/>
            <edc:SFRFieldDef edc:cname="CHANNEL1" edc:nzwidth="0x1" edc:desc="Channel 1 Software Selection"/>
            <edc:SFRFieldDef edc:cname="CHANNEL2" edc:nzwidth="0x1" edc:desc="Channel 2 Software Selection"/>
            <edc:SFRFieldDef edc:cname="CHANNEL3" edc:nzwidth="0x1" edc:desc="Channel 3 Software Selection"/>
            <edc:SFRFieldDef edc:cname="CHANNEL4" edc:nzwidth="0x1" edc:desc="Channel 4 Software Selection"/>
            <edc:SFRFieldDef edc:cname="CHANNEL5" edc:nzwidth="0x1" edc:desc="Channel 5 Software Selection"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="EVSYS" edc:cname="CHANNEL0" edc:nzwidth="0x20" edc:access="----------------nn--nnnn-nnnnnnn" edc:por="00000000000000001000000000000000" edc:mclr="00000000000000001000000000000000" edc:impl="0xCF7F" edc:_addr="0x42000020">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EVSYS">
            <edc:SFRFieldDef edc:cname="EVGEN" edc:nzwidth="0x7" edc:desc="Event Generator Selection"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PATH" edc:nzwidth="0x2" edc:desc="Path Selection">
              <edc:SFRFieldSemantic edc:cname="SYNCHRONOUS" edc:desc="Synchronous path" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="RESYNCHRONIZED" edc:desc="Resynchronized path" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="ASYNCHRONOUS" edc:desc="Asynchronous path" edc:when="(field &amp; 0x3) == 2"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="EDGSEL" edc:nzwidth="0x2" edc:desc="Edge Detection Selection">
              <edc:SFRFieldSemantic edc:cname="NO_EVT_OUTPUT" edc:desc="No event output when using the resynchronized or synchronous path" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="RISING_EDGE" edc:desc="Event detection only on the rising edge of the signal from the event generator when using the resynchronized or synchronous path" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="FALLING_EDGE" edc:desc="Event detection only on the falling edge of the signal from the event generator when using the resynchronized or synchronous path" edc:when="(field &amp; 0x3) == 2"/>
              <edc:SFRFieldSemantic edc:cname="BOTH_EDGES" edc:desc="Event detection on rising and falling edges of the signal from the event generator when using the resynchronized or synchronous path" edc:when="(field &amp; 0x3) == 3"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="RUNSTDBY" edc:nzwidth="0x1" edc:desc="Run in standby"/>
            <edc:SFRFieldDef edc:cname="ONDEMAND" edc:nzwidth="0x1" edc:desc="Generic Clock On Demand"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
