Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMC20_DFP/3.5.93/samc20/edc/ATSAMC20E18A.PIC
      <edc:SFRDef ltx:memberofperipheral="TCC0" edc:cname="FCTRLB" edc:nzwidth="0x20" edc:access="----nnnnnnnnnnnnnnnnnnnnnnnnn-nn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFFFFFFB" edc:_addr="0x42002410">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCC0">
            <edc:SFRFieldDef edc:cname="SRC" edc:nzwidth="0x2" edc:desc="Fault B Source">
              <edc:SFRFieldSemantic edc:cname="DISABLE" edc:desc="Fault input disabled" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLE" edc:desc="MCEx (x=0,1) event input" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="INVERT" edc:desc="Inverted MCEx (x=0,1) event input" edc:when="(field &amp; 0x3) == 2"/>
              <edc:SFRFieldSemantic edc:cname="ALTFAULT" edc:desc="Alternate fault (A or B) state at the end of the previous period" edc:when="(field &amp; 0x3) == 3"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="KEEP" edc:nzwidth="0x1" edc:desc="Fault B Keeper"/>
            <edc:SFRFieldDef edc:cname="QUAL" edc:nzwidth="0x1" edc:desc="Fault B Qualification"/>
            <edc:SFRFieldDef edc:cname="BLANK" edc:nzwidth="0x2" edc:desc="Fault B Blanking Mode">
              <edc:SFRFieldSemantic edc:cname="START" edc:desc="Blanking applied from start of the ramp" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="RISE" edc:desc="Blanking applied from rising edge of the output waveform" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="FALL" edc:desc="Blanking applied from falling edge of the output waveform" edc:when="(field &amp; 0x3) == 2"/>
              <edc:SFRFieldSemantic edc:cname="BOTH" edc:desc="Blanking applied from each toggle of the output waveform" edc:when="(field &amp; 0x3) == 3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="RESTART" edc:nzwidth="0x1" edc:desc="Fault B Restart"/>
            <edc:SFRFieldDef edc:cname="HALT" edc:nzwidth="0x2" edc:desc="Fault B Halt Mode">
              <edc:SFRFieldSemantic edc:cname="DISABLE" edc:desc="Halt action disabled" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HW" edc:desc="Hardware halt action" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="SW" edc:desc="Software halt action" edc:when="(field &amp; 0x3) == 2"/>
              <edc:SFRFieldSemantic edc:cname="NR" edc:desc="Non-recoverable fault" edc:when="(field &amp; 0x3) == 3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CHSEL" edc:nzwidth="0x2" edc:desc="Fault B Capture Channel">
              <edc:SFRFieldSemantic edc:cname="CC0" edc:desc="Capture value stored in channel 0" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="CC1" edc:desc="Capture value stored in channel 1" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="CC2" edc:desc="Capture value stored in channel 2" edc:when="(field &amp; 0x3) == 2"/>
              <edc:SFRFieldSemantic edc:cname="CC3" edc:desc="Capture value stored in channel 3" edc:when="(field &amp; 0x3) == 3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CAPTURE" edc:nzwidth="0x3" edc:desc="Fault B Capture Action">
              <edc:SFRFieldSemantic edc:cname="DISABLE" edc:desc="No capture" edc:when="(field &amp; 0x7) == 0"/>
              <edc:SFRFieldSemantic edc:cname="CAPT" edc:desc="Capture on fault" edc:when="(field &amp; 0x7) == 1"/>
              <edc:SFRFieldSemantic edc:cname="CAPTMIN" edc:desc="Minimum capture" edc:when="(field &amp; 0x7) == 2"/>
              <edc:SFRFieldSemantic edc:cname="CAPTMAX" edc:desc="Maximum capture" edc:when="(field &amp; 0x7) == 3"/>
              <edc:SFRFieldSemantic edc:cname="LOCMIN" edc:desc="Minimum local detection" edc:when="(field &amp; 0x7) == 4"/>
              <edc:SFRFieldSemantic edc:cname="LOCMAX" edc:desc="Maximum local detection" edc:when="(field &amp; 0x7) == 5"/>
              <edc:SFRFieldSemantic edc:cname="DERIV0" edc:desc="Minimum and maximum local detection" edc:when="(field &amp; 0x7) == 6"/>
              <edc:SFRFieldSemantic edc:cname="CAPTMARK" edc:desc="Capture with ramp index as MSB value" edc:when="(field &amp; 0x7) == 7"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="BLANKPRESC" edc:nzwidth="0x1" edc:desc="Fault B Blanking Prescaler"/>
            <edc:SFRFieldDef edc:cname="BLANKVAL" edc:nzwidth="0x8" edc:desc="Fault B Blanking Time"/>
            <edc:SFRFieldDef edc:cname="FILTERVAL" edc:nzwidth="0x4" edc:desc="Fault B Filter Value"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="TCC0" edc:cname="WEXCTRL" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnn----nnnn------nn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFFFF0F03" edc:_addr="0x42002414">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCC0">
            <edc:SFRFieldDef edc:cname="OTMX" edc:nzwidth="0x2" edc:desc="Output Matrix"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="DTIEN0" edc:nzwidth="0x1" edc:desc="Dead-time Insertion Generator 0 Enable"/>
            <edc:SFRFieldDef edc:cname="DTIEN1" edc:nzwidth="0x1" edc:desc="Dead-time Insertion Generator 1 Enable"/>
            <edc:SFRFieldDef edc:cname="DTIEN2" edc:nzwidth="0x1" edc:desc="Dead-time Insertion Generator 2 Enable"/>
            <edc:SFRFieldDef edc:cname="DTIEN3" edc:nzwidth="0x1" edc:desc="Dead-time Insertion Generator 3 Enable"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="DTLS" edc:nzwidth="0x8" edc:desc="Dead-time Low Side Outputs Value"/>
            <edc:SFRFieldDef edc:cname="DTHS" edc:nzwidth="0x8" edc:desc="Dead-time High Side Outputs Value"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="TCC0" edc:cname="DRVCTRL" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x42002418">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCC0">
            <edc:SFRFieldDef edc:cname="NRE0" edc:nzwidth="0x1" edc:desc="Non-Recoverable State 0 Output Enable"/>
            <edc:SFRFieldDef edc:cname="NRE1" edc:nzwidth="0x1" edc:desc="Non-Recoverable State 1 Output Enable"/>
            <edc:SFRFieldDef edc:cname="NRE2" edc:nzwidth="0x1" edc:desc="Non-Recoverable State 2 Output Enable"/>
            <edc:SFRFieldDef edc:cname="NRE3" edc:nzwidth="0x1" edc:desc="Non-Recoverable State 3 Output Enable"/>
            <edc:SFRFieldDef edc:cname="NRE4" edc:nzwidth="0x1" edc:desc="Non-Recoverable State 4 Output Enable"/>
            <edc:SFRFieldDef edc:cname="NRE5" edc:nzwidth="0x1" edc:desc="Non-Recoverable State 5 Output Enable"/>
            <edc:SFRFieldDef edc:cname="NRE6" edc:nzwidth="0x1" edc:desc="Non-Recoverable State 6 Output Enable"/>
            <edc:SFRFieldDef edc:cname="NRE7" edc:nzwidth="0x1" edc:desc="Non-Recoverable State 7 Output Enable"/>
            <edc:SFRFieldDef edc:cname="NRV0" edc:nzwidth="0x1" edc:desc="Non-Recoverable State 0 Output Value"/>
            <edc:SFRFieldDef edc:cname="NRV1" edc:nzwidth="0x1" edc:desc="Non-Recoverable State 1 Output Value"/>
            <edc:SFRFieldDef edc:cname="NRV2" edc:nzwidth="0x1" edc:desc="Non-Recoverable State 2 Output Value"/>
            <edc:SFRFieldDef edc:cname="NRV3" edc:nzwidth="0x1" edc:desc="Non-Recoverable State 3 Output Value"/>
            <edc:SFRFieldDef edc:cname="NRV4" edc:nzwidth="0x1" edc:desc="Non-Recoverable State 4 Output Value"/>
            <edc:SFRFieldDef edc:cname="NRV5" edc:nzwidth="0x1" edc:desc="Non-Recoverable State 5 Output Value"/>
            <edc:SFRFieldDef edc:cname="NRV6" edc:nzwidth="0x1" edc:desc="Non-Recoverable State 6 Output Value"/>
            <edc:SFRFieldDef edc:cname="NRV7" edc:nzwidth="0x1" edc:desc="Non-Recoverable State 7 Output Value"/>
            <edc:SFRFieldDef edc:cname="INVEN0" edc:nzwidth="0x1" edc:desc="Output Waveform 0 Inversion"/>
            <edc:SFRFieldDef edc:cname="INVEN1" edc:nzwidth="0x1" edc:desc="Output Waveform 1 Inversion"/>
            <edc:SFRFieldDef edc:cname="INVEN2" edc:nzwidth="0x1" edc:desc="Output Waveform 2 Inversion"/>
            <edc:SFRFieldDef edc:cname="INVEN3" edc:nzwidth="0x1" edc:desc="Output Waveform 3 Inversion"/>
            <edc:SFRFieldDef edc:cname="INVEN4" edc:nzwidth="0x1" edc:desc="Output Waveform 4 Inversion"/>
            <edc:SFRFieldDef edc:cname="INVEN5" edc:nzwidth="0x1" edc:desc="Output Waveform 5 Inversion"/>
            <edc:SFRFieldDef edc:cname="INVEN6" edc:nzwidth="0x1" edc:desc="Output Waveform 6 Inversion"/>
            <edc:SFRFieldDef edc:cname="INVEN7" edc:nzwidth="0x1" edc:desc="Output Waveform 7 Inversion"/>
            <edc:SFRFieldDef edc:cname="FILTERVAL0" edc:nzwidth="0x4" edc:desc="Non-Recoverable Fault Input 0 Filter Value"/>
            <edc:SFRFieldDef edc:cname="FILTERVAL1" edc:nzwidth="0x4" edc:desc="Non-Recoverable Fault Input 1 Filter Value"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x2" edc:_addr="0x4200241C"/>
      <edc:SFRDef ltx:memberofperipheral="TCC0" edc:cname="DBGCTRL" edc:nzwidth="0x8" edc:access="-----n-n" edc:por="00000000" edc:mclr="00000000" edc:impl="0x5" edc:_addr="0x4200241E">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCC0">
            <edc:SFRFieldDef edc:cname="DBGRUN" edc:nzwidth="0x1" edc:desc="Debug Running Mode"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="FDDBD" edc:nzwidth="0x1" edc:desc="Fault Detection on Debug Break Detection"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
